docs/papers/20241201-geometricinr.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-10-23 Thu 13:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Geometric implicit neural representations for signed distance functions</title>
<meta name="author" content="Luiz Schirmer, Tiago Novello, Vinícius da Silva, *Guilherme Schardong*, Daniel Perazzo, Hélio Lopes, Nuno Gonçalves, Luiz Velho" />
<meta name="generator" content="Org Mode" />
<meta name="referrer" content="origin" />
<link rel="stylesheet" href="../css/tufte.css" type="text/css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Geometric implicit neural representations for signed distance functions</h1>

<div id="outline-container-org8e6beff" class="outline-2">
<h2 id="org8e6beff">Abstract</h2>
<div class="outline-text-2" id="text-org8e6beff">
<p>
Implicit neural representations (INRs) have emerged as a promising framework for representing signals in low-dimensional spaces. This survey reviews the existing literature on the specialized INR problem of approximating signed distance functions (SDFs) for surface scenes, using either oriented point clouds or a set of posed images. We refer to neural SDFs that incorporate differential geometry tools, such as normals and curvatures, in their loss functions as geometric INRs. The key idea behind this 3D reconstruction approach is to include additional regularization terms in the loss function, ensuring that the INR satisfies certain global properties that the function should hold — such as having unit gradient in the case of SDFs. We explore key methodological components, including the definition of INR, the construction of geometric loss functions, and sampling schemes from a differential geometry perspective. Our review highlights the significant advancements enabled by geometric INRs in surface reconstruction from oriented point clouds and posed images.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Luiz Schirmer, Tiago Novello, Vinícius da Silva, <b>Guilherme Schardong</b>, Daniel Perazzo, Hélio Lopes, Nuno Gonçalves, Luiz Velho</p>
<p class="date">Created: 2025-10-23 Thu 13:47</p>
</div>
</body>
</html>
